InformationRegisters/ДублиНСИКПодтверждению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДублиНСИКПодтверждению</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаПоискаДублейНСИ</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоМестИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоискаМестИспользования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипСсылки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаДублей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дубль</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДублиНСИКПодтверждению/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Добавляет дубли к подтверждению
//
// Параметры:
//   Дубли - Массив из СправочникСсылка.ПравилаПоискаДублейНСИ,СправочникСсылка.Пользователи
//         - ТаблицаЗначений - таблица, содержащая пары дублей для добавления:
//           * Ссылка1 - СправочникСсылка, ПланВидовХарактеристикСсылка - ссылка на дубль
//           * Ссылка2 - СправочникСсылка, ПланВидовХарактеристикСсылка - ссылка на дубль,
//   Источник - СправочникСсылка.ПравилаПоискаДублейНСИ - правило поиска, по которому найдены дубли
//            - СправочникСсылка.Пользователи - пользователь, который отметил элементы дублями
//   РассчетМестИспользования - Неопределено, Булево - необходимость дополнить записи информацией об использовании ссылок.
//
Процедура ДобавитьДубли(Дубли, Источник, РассчетМестИспользования = Неопределено) Экспорт
	
	Данные = НормализованнаяИнформацияОДублях(Дубли);
	ДублиОтбор = Данные.ДублиОтбор;
	ПарыДублей = Данные.ПарыДублей;
	
	ТаблицаДляЗаписи = РаспределитьДублиПоГруппам(ПарыДублей, Источник, СуществующиеДубли(ДублиОтбор));
	ДополнитьИнформациейПоСсылкам(ТаблицаДляЗаписи, РассчетМестИспользования);
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(ТаблицаДляЗаписи);
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей.Записать(РежимЗамещения.Добавление);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Обновляет информацию о местах использования для указанных дублей НСИ.
//
// Параметры:
//   ДублиКОбновлению - Массив из СправочникСсылка,ПланВидовХарактеристикСсылка - дубли для которых требуется пересчет
//                                                                                мест использования.
//
// Возвращаемое значение:
//   Соответствие из СправочникСсылка,ПланВидовХарактеристикСсылка:
//     * Ключ - СправочникСсылка,ПланВидовХарактеристикСсылка - дубль.
//     * Значение - Структура - с ключами "ДатаПоискаМестИспользования" и "КоличествоМестИспользования":
//        ** ДатаПоискаМестИспользования - Дата.
//        ** КоличествоМестИспользования - Число.
//
Функция ПеречитатьМестаИспользования(ДублиКОбновлению) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДублиНСИКПодтверждению.ТипСсылки КАК ТипСсылки,
		|	ДублиНСИКПодтверждению.ГруппаДублей КАК ГруппаДублей,
		|	ДублиНСИКПодтверждению.Дубль КАК Дубль,
		|	ДублиНСИКПодтверждению.Источник КАК Источник,
		|	ДублиНСИКПодтверждению.ДатаДобавления КАК ДатаДобавления,
		|	ДублиНСИКПодтверждению.ДатаПоискаМестИспользования КАК ДатаПоискаМестИспользования,
		|	ДублиНСИКПодтверждению.КоличествоМестИспользования КАК КоличествоМестИспользования
		|ИЗ
		|	РегистрСведений.ДублиНСИКПодтверждению КАК ДублиНСИКПодтверждению
		|ГДЕ
		|ДублиНСИКПодтверждению.Дубль В (&Дубли)";
	Запрос.УстановитьПараметр("Дубли", ДублиКОбновлению);
	
	НаборВыгрузка = Запрос.Выполнить().Выгрузить();
	ДополнитьИнформациейПоСсылкам(НаборВыгрузка, Истина);
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(НаборВыгрузка);
	НаборЗаписей.Записать(РежимЗамещения.Обновление);
	
	Результат = Новый Соответствие;
	Для Каждого Запись Из НаборВыгрузка Цикл
		Если Результат[Запись.Дубль] = Неопределено Тогда
			ДанныеДубля = Новый Структура;
			ДанныеДубля.Вставить("ДатаПоискаМестИспользования", Запись.ДатаПоискаМестИспользования);
			ДанныеДубля.Вставить("КоличествоМестИспользования", Запись.КоличествоМестИспользования);
			
			Результат.Вставить(Запись.Дубль, ДанныеДубля);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Удаляет записи регистра, входящие в указанные группы дублей. Если переданы дубли, то удаляются записи только
// с этими дублями, если не переданы, то удаляется все группы целиком.
//
// Параметры:
//   ИдентификаторыГрупп - Строка - идентификатор группы дублей, записи которой необходимо удалить.
//                       - Массив из Строка - идентификаторы группы дублей, записи которых необходимо удалить.
//   Дубли - СправочникСсылка,ПланВидовХарактеристикСсылка.
//         - Массив из СправочникСсылка,ПланВидовХарактеристикСсылка - дубли, которые необходимо удалить.
//
Процедура УдалитьДубли(ИдентификаторыГрупп, Дубли = Неопределено) Экспорт
	
	Если ТипЗнч(ИдентификаторыГрупп) <> Тип("Массив") Тогда
		Группы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИдентификаторыГрупп);
	Иначе
		Группы = ИдентификаторыГрупп;
	КонецЕсли;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ДублиНСИКПодтверждению.ТипСсылки КАК ТипСсылки,
		|	ДублиНСИКПодтверждению.ГруппаДублей КАК ГруппаДублей,
		|	ДублиНСИКПодтверждению.Дубль КАК Дубль,
		|	ДублиНСИКПодтверждению.Источник КАК Источник,
		|	ДублиНСИКПодтверждению.ДатаДобавления КАК ДатаДобавления,
		|	ДублиНСИКПодтверждению.КоличествоМестИспользования КАК КоличествоМестИспользования,
		|	ДублиНСИКПодтверждению.ДатаПоискаМестИспользования КАК ДатаПоискаМестИспользования,
		|	АВТОНОМЕРЗАПИСИ() КАК НомерПоПорядку
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	РегистрСведений.ДублиНСИКПодтверждению КАК ДублиНСИКПодтверждению
		|ГДЕ
		|	ДублиНСИКПодтверждению.ГруппаДублей В (&Группы)
		|	И &ОтборДубли
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблица.ТипСсылки КАК ТипСсылки,
		|	ВременнаяТаблица.ГруппаДублей КАК ГруппаДублей,
		|	ВременнаяТаблица.Дубль КАК Дубль,
		|	ВременнаяТаблица.Источник КАК Источник,
		|	ВременнаяТаблица.ДатаДобавления КАК ДатаДобавления,
		|	ВременнаяТаблица.КоличествоМестИспользования КАК КоличествоМестИспользования,
		|	ВременнаяТаблица.ДатаПоискаМестИспользования КАК ДатаПоискаМестИспользования,
		|	ЦЕЛ(ВременнаяТаблица.НомерПоПорядку / &КратностьГрупп) КАК Группа
		|ПОМЕСТИТЬ Результат
		|ИЗ
		|	ВременнаяТаблица КАК ВременнаяТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Результат.ТипСсылки КАК ТипСсылки,
		|	Результат.ГруппаДублей КАК ГруппаДублей,
		|	Результат.Дубль КАК Дубль,
		|	Результат.Источник КАК Источник,
		|	Результат.ДатаДобавления КАК ДатаДобавления,
		|	Результат.КоличествоМестИспользования КАК КоличествоМестИспользования,
		|	Результат.ДатаПоискаМестИспользования КАК ДатаПоискаМестИспользования,
		|	Результат.Группа КАК Группа
		|ИЗ
		|	Результат КАК Результат
		|ИТОГИ
		|ПО
		|	Группа";
		
	Запрос = Новый Запрос;
	
	Если Дубли <> Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборДубли", "ДублиНСИКПодтверждению.Дубль В (&Дубли)");
		Запрос.УстановитьПараметр("Дубли", Дубли);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборДубли", "ИСТИНА");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Группы", Группы);
	Запрос.УстановитьПараметр("КратностьГрупп", 100);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаГруппа = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаГруппа.Следующий() Цикл
		НаборКУдалению = СоздатьНаборЗаписей();
		
		Выборка = ВыборкаГруппа.Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(НаборКУдалению.Добавить(), Выборка);
		КонецЦикла;
		
		НаборКУдалению.Записать(РежимЗамещения.Удаление);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДублиНСИКПодтверждению.ГруппаДублей КАК ГруппаДублей,
		|	КОЛИЧЕСТВО(ДублиНСИКПодтверждению.Дубль) КАК Дубль
		|ПОМЕСТИТЬ ГруппыКУдалению
		|ИЗ
		|	РегистрСведений.ДублиНСИКПодтверждению КАК ДублиНСИКПодтверждению
		|СГРУППИРОВАТЬ ПО
		|	ДублиНСИКПодтверждению.ГруппаДублей
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(ДублиНСИКПодтверждению.Дубль) = 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДублиНСИКПодтверждению.ТипСсылки КАК ТипСсылки,
		|	ДублиНСИКПодтверждению.ГруппаДублей КАК ГруппаДублей,
		|	ДублиНСИКПодтверждению.Дубль КАК Дубль,
		|	ДублиНСИКПодтверждению.Источник КАК Источник,
		|	ДублиНСИКПодтверждению.ДатаДобавления КАК ДатаДобавления,
		|	ДублиНСИКПодтверждению.КоличествоМестИспользования КАК КоличествоМестИспользования,
		|	ДублиНСИКПодтверждению.ДатаПоискаМестИспользования КАК ДатаПоискаМестИспользования
		|ИЗ
		|	РегистрСведений.ДублиНСИКПодтверждению КАК ДублиНСИКПодтверждению
		|ГДЕ
		|	ДублиНСИКПодтверждению.ГруппаДублей В
		|		(ВЫБРАТЬ
		|			Т.ГруппаДублей
		|		ИЗ
		|			ГруппыКУдалению КАК Т)";
	ГруппыСОднимДублем = Запрос.Выполнить().Выгрузить();
	НаборКУдалению = СоздатьНаборЗаписей();
	НаборКУдалению.Загрузить(ГруппыСОднимДублем);
	НаборКУдалению.Записать(РежимЗамещения.Удаление);
	
КонецПроцедуры

// Удаляет из регистра сведений ДублиНСИКПодтверждению записи о потенциальных дублях, которые
// больше не соответствуют правилу поиска.
//
// Параметры:
//   ПарыДублей - ТаблицаЗначений - таблица, содержащая пары дублей:
//           * Ссылка1 - СправочникСсылка, ПланВидовХарактеристикСсылка - ссылка на дубль.
//           * Ссылка2 - СправочникСсылка, ПланВидовХарактеристикСсылка - ссылка на дубль.
//   Источник - СправочникСсылка.ПравилаПоискаДублейНСИ - правило поиска, по которому найдены дубли.
//
Процедура ПроверитьДублиНаСоответствиеПравилуПоиска(ПарыДублей, Источник) Экспорт
	
	Дубли = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Дубли, ПарыДублей.ВыгрузитьКолонку(0), Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Дубли, ПарыДублей.ВыгрузитьКолонку(1), Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДублиНСИКПодтверждению.ТипСсылки КАК ТипСсылки,
		|	ДублиНСИКПодтверждению.ГруппаДублей КАК ГруппаДублей,
		|	ДублиНСИКПодтверждению.Дубль КАК Дубль,
		|	ДублиНСИКПодтверждению.Источник КАК Источник
		|ПОМЕСТИТЬ втНовыеДубли
		|ИЗ
		|	РегистрСведений.ДублиНСИКПодтверждению КАК ДублиНСИКПодтверждению
		|ГДЕ
		|	ДублиНСИКПодтверждению.Источник = &Источник
		|	И ДублиНСИКПодтверждению.Дубль В (&Дубли)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДублиНСИКПодтверждению.ТипСсылки КАК ТипСсылки,
		|	ДублиНСИКПодтверждению.ГруппаДублей КАК ГруппаДублей,
		|	ДублиНСИКПодтверждению.Дубль КАК Дубль,
		|	ДублиНСИКПодтверждению.Источник КАК Источник,
		|	ДублиНСИКПодтверждению.ДатаДобавления КАК ДатаДобавления,
		|	ДублиНСИКПодтверждению.КоличествоМестИспользования КАК КоличествоМестИспользования,
		|	ДублиНСИКПодтверждению.ДатаПоискаМестИспользования КАК ДатаПоискаМестИспользования
		|ПОМЕСТИТЬ втДублиПоПравилу
		|ИЗ
		|	РегистрСведений.ДублиНСИКПодтверждению КАК ДублиНСИКПодтверждению
		|ГДЕ
		|	ДублиНСИКПодтверждению.Источник = &Источник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДублиПоПравилу.ТипСсылки КАК ТипСсылки,
		|	втДублиПоПравилу.ГруппаДублей КАК ГруппаДублей,
		|	втДублиПоПравилу.Дубль КАК Дубль,
		|	втДублиПоПравилу.Источник КАК Источник,
		|	втДублиПоПравилу.ДатаДобавления КАК ДатаДобавления,
		|	втДублиПоПравилу.КоличествоМестИспользования КАК КоличествоМестИспользования,
		|	втДублиПоПравилу.ДатаПоискаМестИспользования КАК ДатаПоискаМестИспользования
		|ИЗ
		|	втДублиПоПравилу КАК втДублиПоПравилу
		|		ЛЕВОЕ СОЕДИНЕНИЕ втНовыеДубли КАК втНовыеДубли
		|		ПО втДублиПоПравилу.ТипСсылки = втНовыеДубли.ТипСсылки
		|		И втДублиПоПравилу.Дубль = втНовыеДубли.Дубль
		|		И втДублиПоПравилу.ГруппаДублей = втНовыеДубли.ГруппаДублей
		|		И втДублиПоПравилу.Источник = втНовыеДубли.Источник
		|ГДЕ
		|	втНовыеДубли.Дубль ЕСТЬ NULL";
		
	Запрос.УстановитьПараметр("Источник", Источник);
	Запрос.УстановитьПараметр("Дубли", Дубли);
	
	ЗаписиКУдалению = Запрос.Выполнить().Выгрузить();
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(ЗаписиКУдалению);
	НаборЗаписей.Записать(РежимЗамещения.Удаление);
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЧтениеСпискаРазрешено(ТипСсылки)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыйНаборДляЗаписи(ОписаниеТиповТаблицы) Экспорт
	
	ТаблицаДляЗаписи = Новый ТаблицаЗначений;
	Колонки = "ТипСсылки,ГруппаДублей,Дубль,Источник,ДатаДобавления,КоличествоМестИспользования,ДатаПоискаМестИспользования";
	
	Для Каждого Колонка Из СтрРазделить(Колонки, ",", Ложь) Цикл
		ТаблицаДляЗаписи.Колонки.Добавить(Колонка, ОписаниеТиповТаблицы[Колонка]);
	КонецЦикла;
	
	Возврат ТаблицаДляЗаписи;
	
КонецФункции

Функция ОписаниеТиповТаблицыРегистра() Экспорт
	
	Результат = Новый Структура;
	
	Регистр = Метаданные.РегистрыСведений.ДублиНСИКПодтверждению;
	
	Для Каждого Измерение Из Регистр.Измерения Цикл
		Результат.Вставить(Измерение.Имя, Измерение.Тип);
	КонецЦикла;
	
	Для Каждого Ресурс Из Регистр.Ресурсы Цикл
		Результат.Вставить(Ресурс.Имя, Ресурс.Тип);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция НормализованнаяИнформацияОДублях(Дубли)
	
	Результат = Новый Структура;
	Результат.Вставить("ДублиОтбор");
	Результат.Вставить("ПарыДублей");
	
	Если ТипЗнч(Дубли) = Тип("Массив") Тогда
		Результат.ДублиОтбор = Дубли;
		Результат.ПарыДублей = ПарыДублей(Дубли);
	Иначе
		ДублиОтбор = Новый Массив;
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДублиОтбор, Дубли.ВыгрузитьКолонку(0), Истина);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДублиОтбор, Дубли.ВыгрузитьКолонку(1), Истина);
		
		Результат.ДублиОтбор = ДублиОтбор;
		Результат.ПарыДублей = Дубли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПарыДублей(Дубли)
	
	КопияМассива = ОбщегоНазначения.СкопироватьРекурсивно(Дубли);
	
	ПарыДублей = Новый ТаблицаЗначений;
	ПарыДублей.Колонки.Добавить("Ссылка1");
	ПарыДублей.Колонки.Добавить("Ссылка2");
	
	ВсегоВМассиве = КопияМассива.количество() - 1;
	Для Индекс = 0 По ВсегоВМассиве Цикл
		
		ОбратныйИндекс = ВсегоВМассиве - Индекс;
		
		Для Каждого ЭлементМассива Из КопияМассива Цикл
			Если КопияМассива[ОбратныйИндекс] <> ЭлементМассива Тогда
				Строка = ПарыДублей.Добавить();
				Строка.Ссылка1 = КопияМассива[ОбратныйИндекс];
				Строка.Ссылка2 = ЭлементМассива;
			КонецЕсли;
		КонецЦикла;
		
		КопияМассива.Удалить(ОбратныйИндекс);
		
	КонецЦикла;
	
	Возврат ПарыДублей;
	
КонецФункции

Процедура ДобавитьДубльВИндекс(ИндексыГрупп, Дубль, ГруппаДублей, Источник)
	
	НоваяСтрока = ИндексыГрупп.Добавить();
	НоваяСтрока.Дубль = Дубль;
	НоваяСтрока.ГруппаДублей = ГруппаДублей;
	НоваяСтрока.Источник = Источник;
	
КонецПроцедуры

// Возвращает массив групп, в которых содержится указанный дублирующий объект.
//
// Параметры:
//   ИндексДублиИГруппы - ТаблицаЗначений - таблица-индекс, содержащая связи дублей с группами и источниками
//   Дубль - СправочникСсылка
//         - ПланВидовХарактеристикСсылка - объект, для которого ищутся группы
//
// Возвращаемое значение:
//   Массив из Структура:
//                       * ГруппаДублей - Строка
//                       * Источник - СправочникСсылка.ПравилаПоискаДублейНСИ,СправочникСсылка.Пользователи
//
Функция ГруппыДубляВИндексе(ИндексДублиИГруппы, Дубль)
	
	Результат = Новый Массив;
	
	СтрокиПоиска = ИндексДублиИГруппы.НайтиСтроки(Новый Структура("Дубль", Дубль));
	Для Каждого СтрокаПоиска Из СтрокиПоиска Цикл
		Результат.Добавить(Новый Структура("ГруппаДублей, Источник", СтрокаПоиска.ГруппаДублей, СтрокаПоиска.Источник));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьСтрокуВНабор(ТаблицаДляЗаписи, Дубль, ГруппаДублей, Источник)
	
	НоваяСтрока = ТаблицаДляЗаписи.Добавить();
	НоваяСтрока.Дубль = Дубль;
	НоваяСтрока.ГруппаДублей = ГруппаДублей;
	НоваяСтрока.Источник = Источник;
	
КонецПроцедуры

Функция НужноСоздатьНовуюГруппу(ГруппыДубляОдин, ГруппыДубляДва)
	
	ОбеНепустые = ГруппыДубляОдин.Количество() > 0 И ГруппыДубляДва.Количество() > 0;
	ОбеПустые = ГруппыДубляОдин.Количество() = 0 И ГруппыДубляДва.Количество() = 0;
	
	Если ОбеНепустые Или ОбеПустые Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ДублиНаходятсяВОднойГруппе(Группа1, Группа2)
	
	ВсеГруппы = Новый Массив;
	
	Для Каждого ЭлементМасива Из Группа1 Цикл
		ВсеГруппы.Добавить(ЭлементМасива.ГруппаДублей);
	КонецЦикла;
	
	Для Каждого ЭлементМасива Из Группа2 Цикл
		ВсеГруппы.Добавить(ЭлементМасива.ГруппаДублей);
	КонецЦикла;
	
	УникальныеГруппы = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(УникальныеГруппы, ВсеГруппы, Истина);
	
	ЭтоДублиИзОднойГруппы = ВсеГруппы.Количество() <> УникальныеГруппы.Количество();
	
	Возврат ЭтоДублиИзОднойГруппы;
	
КонецФункции

// Дополняет таблицу строк информацией о типах ссылок и количестве мест использования дублей НСИ.
//
// Параметры:
//   ТаблицаДляЗаписи - ТаблицаЗначений - таблица, содержащая колонку "Дубль" со ссылками для обработки.
//   РежимОбновленияМестИспользования - Булево, Неопределено - определяет режим обновления количества мест использования.
//      Если Неопределено, тогда обновления не происходит.
//      Если Истина, тогда обновление происходит.
//      Если Ложь, тогда обновление зависит от значения константы ВыполнятьПоискМестИспользованияДублейНСИ.
//
Процедура ДополнитьИнформациейПоСсылкам(ТаблицаДляЗаписи, РежимОбновленияМестИспользования = Неопределено) Экспорт
	
	Дубли = ТаблицаДляЗаписи.ВыгрузитьКолонку("Дубль");
	ПодсчетСсылок = Новый Соответствие;
	Для Каждого Дубль Из Дубли Цикл
		ИнформацияОСсылке = Новый Структура;
		ИнформацияОСсылке.Вставить("МестИспользования", 0);
		ИнформацияОСсылке.Вставить("ПолноеИмяОбъектаМетаданных", ОбщегоНазначения.ИмяТаблицыПоСсылке(Дубль));
		ИнформацияОСсылке.Вставить("ДатаПоискаМестИспользования");
		ИнформацияОСсылке.Вставить("ДатаДобавления");
		
		ПодсчетСсылок.Вставить(Дубль, ИнформацияОСсылке);
	КонецЦикла;
	
	Если РежимОбновленияМестИспользования = Неопределено Тогда
		ИскатьМестаИспользования = Ложь;
	Иначе
		УстановитьПривилегированныйРежим(Истина);
		ИскатьМестаИспользования = Константы.ВыполнятьПоискМестИспользованияДублейНСИ.Получить()
			Или РежимОбновленияМестИспользования;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Если ИскатьМестаИспользования Тогда
		РезультатПоиска = ОбщегоНазначения.МестаИспользования(Дубли);
		ДатаПоиска = ТекущаяДатаСеанса();
		
		Для Каждого СтрокаПоиска Из РезультатПоиска Цикл
			Если Не СтрокаПоиска.ЭтоСлужебныеДанные Тогда
				ИнформацияОСсылке = ПодсчетСсылок[СтрокаПоиска.Ссылка];
				ИнформацияОСсылке.МестИспользования = ИнформацияОСсылке.МестИспользования + 1;
				ИнформацияОСсылке.ДатаПоискаМестИспользования = ДатаПоиска;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ДатаДобавления = ТекущаяДатаСеанса();
	Для Каждого СтрокаДляЗаписи Из ТаблицаДляЗаписи Цикл
		ИнформацияОСсылке = ПодсчетСсылок[СтрокаДляЗаписи.Дубль];
		
		СтрокаДляЗаписи.ТипСсылки = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ИнформацияОСсылке.ПолноеИмяОбъектаМетаданных);
		Если Не ЗначениеЗаполнено(СтрокаДляЗаписи.ДатаДобавления) Тогда
			СтрокаДляЗаписи.ДатаДобавления = ДатаДобавления;
		КонецЕсли;
		
		Если ИскатьМестаИспользования Тогда
			СтрокаДляЗаписи.КоличествоМестИспользования = ИнформацияОСсылке.МестИспользования;
			СтрокаДляЗаписи.ДатаПоискаМестИспользования = ИНформацияОСсылке.ДатаПоискаМестИспользования;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Возвращает количество дублирующихся записей для каждого типа справочника из доступных.
//
// Возвращаемое значение:
//   ТаблицаЗначений:
//     * ТипСсылки - СправочникСсылка.ИдентификаторыОбъектовМетаданных
//     * КоличествоДублей - Число
//
Функция ТипыДубейСКоличеством() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДублиНСИКПодтверждению.ТипСсылки КАК ТипСсылки,
		|	КОЛИЧЕСТВО(ДублиНСИКПодтверждению.Дубль) КАК КоличествоДублей
		|ИЗ
		|	РегистрСведений.ДублиНСИКПодтверждению КАК ДублиНСИКПодтверждению
		|СГРУППИРОВАТЬ ПО
		|	ДублиНСИКПодтверждению.ТипСсылки";
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

// Возвращает выборку записей по указанным дублям.
//
// Параметры:
//   ДублиОтбор - Массив из СправочникСсылка,ПланВидовХарактеристикСсылка - значения для отбора по полю "Дубль"
//
// Возвращаемое значение:
//   ВыборкаИзРезультатаЗапроса - Выборка из результата запроса:
//     * Дубль - СправочникСсылка,ПланВидовХарактеристикСсылка - ссылка на дубль.
//     * ГруппаДублей - Строка - идентификатор группы дублей.
//     * Источник - СправочникСсылка.ПравилаПоискаДублейНСИ,СправочникСсылка.Пользователи.
//
Функция СуществующиеДубли(ДублиОтбор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДублиНСИКПодтверждению.Дубль КАК Дубль,
	|	ДублиНСИКПодтверждению.ГруппаДублей КАК ГруппаДублей,
	|	ДублиНСИКПодтверждению.Источник КАК Источник
	|ИЗ
	|	РегистрСведений.ДублиНСИКПодтверждению КАК ДублиНСИКПодтверждению
	|ГДЕ
	|	ДублиНСИКПодтверждению.Дубль В (&ДублиОтбор)";
	Запрос.УстановитьПараметр("ДублиОтбор", ДублиОтбор);
	
	УстановитьПривилегированныйРежим(Истина);
	РезутьтатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат РезутьтатЗапроса.Выбрать();
	
КонецФункции

// Распределяет дубли по группам на основе переданных пар дублей и источника данных.
//
// Параметры:
//   ПарыДублей - ТаблицаЗначений - дублей для распределения:
//     * Ссылка1 - СправочникСсылка,ПланВидовХарактеристикСсылка - ссылка на дубль.
//     * Ссылка2 - СправочникСсылка,ПланВидовХарактеристикСсылка - ссылка на дубль.
//   Источник - СправочникСсылка.ПравилаПоискаДублейНСИ,СправочникСсылка.Пользователи - правило поиска дублей или ответсвтенный.
//   ДублиВБазе - ВыборкаИзРезультатаЗапроса - см. СуществующиеДубли
//
// Возвращаемое значение:
//   ТаблицаЗначений - таблица с распределенными по группам дублями:
//     * Дубль - СправочникСсылка,ПланВидовХарактеристикСсылка - ссылка на дубль.
//     * ГруппаДублей - Строка - идентификатор группы дублей.
//     * Источник - СправочникСсылка.ПравилаПоискаДублейНСИ,СправочникСсылка.Пользователи
//
Функция РаспределитьДублиПоГруппам(ПарыДублей, Источник, ДублиВБазе = Неопределено) Экспорт
	
	ОписаниеТиповТаблицы = ОписаниеТиповТаблицыРегистра();
	ОписаниеТиповТаблицы.Дубль = ПарыДублей.Колонки[0].ТипЗначения;
	
	ИндексДублиИГруппы = Новый ТаблицаЗначений;
	ИндексДублиИГруппы.Колонки.Добавить("Дубль", ОписаниеТиповТаблицы.Дубль);
	ИндексДублиИГруппы.Колонки.Добавить("ГруппаДублей", ОписаниеТиповТаблицы.ГруппаДублей);
	ИндексДублиИГруппы.Колонки.Добавить("Источник", ОписаниеТиповТаблицы.Источник);
	ИндексДублиИГруппы.Индексы.Добавить("Дубль");
	ИндексДублиИГруппы.Индексы.Добавить("Источник");
	
	Если ТипЗнч(ДублиВБазе) = Тип("ВыборкаИзРезультатаЗапроса") Тогда
		Пока ДублиВБазе.Следующий() Цикл
			ДобавитьДубльВИндекс(ИндексДублиИГруппы, ДублиВБазе.Дубль, ДублиВБазе.ГруппаДублей, ДублиВБазе.Источник);
		КонецЦикла;
	КонецЕсли;
	
	ДублиПоГруппам = НовыйНаборДляЗаписи(ОписаниеТиповТаблицы);
	
	Для Каждого ПараДублей Из ПарыДублей Цикл
		
		ДубльОдин = ПараДублей[0];
		ДубльДва = ПараДублей[1];
		
		ГруппыДубляОдин = ГруппыДубляВИндексе(ИндексДублиИГруппы, ДубльОдин);
		ГруппыДубляДва = ГруппыДубляВИндексе(ИндексДублиИГруппы, ДубльДва);
		
		Если ДублиНаходятсяВОднойГруппе(ГруппыДубляОдин, ГруппыДубляДва) Тогда
			
			Продолжить;
			
		ИначеЕсли НужноСоздатьНовуюГруппу(ГруппыДубляОдин, ГруппыДубляДва) Тогда
			
			НоваяГруппа = Строка(Новый УникальныйИдентификатор());
			ДобавитьДубльВИндекс(ИндексДублиИГруппы, ДубльОдин, НоваяГруппа, Источник);
			ДобавитьДубльВИндекс(ИндексДублиИГруппы, ДубльДва, НоваяГруппа, Источник);
			ДобавитьСтрокуВНабор(ДублиПоГруппам, ДубльОдин, НоваяГруппа, Источник);
			ДобавитьСтрокуВНабор(ДублиПоГруппам, ДубльДва, НоваяГруппа, Источник);
			
		ИначеЕсли ГруппыДубляОдин.Количество() = 0 Тогда
			
			Для Каждого ГруппаИсточник Из ГруппыДубляДва Цикл
				Если ГруппаИсточник.Источник = Источник Тогда
					Группа = ГруппаИсточник.ГруппаДублей;
					ДобавитьДубльВИндекс(ИндексДублиИГруппы, ДубльОдин, Группа, Источник);
					ДобавитьСтрокуВНабор(ДублиПоГруппам, ДубльОдин, Группа, Источник);
					Прервать;
				Иначе
					НоваяГруппа = Строка(Новый УникальныйИдентификатор());
					ДобавитьДубльВИндекс(ИндексДублиИГруппы, ДубльОдин, НоваяГруппа, Источник);
					ДобавитьДубльВИндекс(ИндексДублиИГруппы, ДубльДва, НоваяГруппа, Источник);
					ДобавитьСтрокуВНабор(ДублиПоГруппам, ДубльОдин, НоваяГруппа, Источник);
					ДобавитьСтрокуВНабор(ДублиПоГруппам, ДубльДва, НоваяГруппа, Источник);
				КонецЕсли;
			КонецЦикла;
			
		ИначеЕсли ГруппыДубляДва.Количество() = 0 Тогда
			
			Для Каждого ГруппаИсточник Из ГруппыДубляОдин Цикл
				Если ГруппаИсточник.Источник = Источник Тогда
					Группа = ГруппаИсточник.ГруппаДублей;
					ДобавитьДубльВИндекс(ИндексДублиИГруппы, ДубльДва, Группа, Источник);
					ДобавитьСтрокуВНабор(ДублиПоГруппам, ДубльДва, Группа, Источник);
					Прервать;
				Иначе
					НоваяГруппа = Строка(Новый УникальныйИдентификатор());
					ДобавитьДубльВИндекс(ИндексДублиИГруппы, ДубльОдин, НоваяГруппа, Источник);
					ДобавитьДубльВИндекс(ИндексДублиИГруппы, ДубльДва, НоваяГруппа, Источник);
					ДобавитьСтрокуВНабор(ДублиПоГруппам, ДубльОдин, НоваяГруппа, Источник);
					ДобавитьСтрокуВНабор(ДублиПоГруппам, ДубльДва, НоваяГруппа, Источник);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДублиПоГруппам;
	
КонецФункции

// Формирует строковое представление группы по наименованиям элементов из входящего массива.
//
// Параметры:
//   Массив - Массив из СправочникСсылка.ПравилаПоискаДублейНСИ - коллекция значений, содержащая ссылки на элементы справочников-дублей
//
// Возвращаемое значение:
//   Строка - Представление группы
//
Функция ПредставлениеГруппы(Массив) Экспорт
	
	Результат = "";
	ОграничениеДлины = 100;
	
	МассивРезультатов = Новый Массив;
	Для Каждого Элемент Из Массив Цикл
		Если МассивРезультатов.Найти(Элемент) = Неопределено Тогда
			МассивРезультатов.Добавить(СокрЛП(Элемент));
		КонецЕсли;
	КонецЦикла;
	Результат = Лев(СтрСоединить(МассивРезультатов, ","),ОграничениеДлины) + "...";
	
	Возврат Результат;
	
КонецФункции

// Возвращает массив идентификаторов групп, связанных с указанной группой через общие дубли.
//
// Параметры:
//   Группа - Строка - идентификатор группы дублей.
//
// Возвращаемое значение:
//   Массив из Строка
//
Функция СвязанныеГруппы(Группа) Экспорт
	
	СвязанныеГруппы = Новый Соответствие;
	СвязанныеГруппы.Вставить(Группа, Истина);
	
	Стек = Новый Массив;
	Стек.Добавить(Группа);
	
	Пока Стек.Количество() > 0 Цикл
		Индекс = Стек.ВГраница();
		ТекущаяГруппа = Стек.Получить(Индекс);
		Стек.Удалить(Индекс);
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Таблица2.ГруппаДублей КАК СвязаннаяГруппа
			|ИЗ
			|	РегистрСведений.ДублиНСИКПодтверждению КАК Таблица1
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДублиНСИКПодтверждению КАК Таблица2
			|		ПО Таблица1.Дубль = Таблица2.Дубль
			|ГДЕ
			|	Таблица1.ГруппаДублей = &ТекущаяГруппа
			|	И Таблица2.ГруппаДублей <> &ТекущаяГруппа
			|	И Таблица2.ГруппаДублей НЕ В (&ПосещенныеГруппы)";
		
		ПосещенныеГруппы = Новый Массив;
		Для Каждого КлючЗначение Из СвязанныеГруппы Цикл
			ПосещенныеГруппы.Добавить(КлючЗначение.Ключ);
		КонецЦикла;
		
		Запрос.УстановитьПараметр("ТекущаяГруппа", ТекущаяГруппа);
		Запрос.УстановитьПараметр("ПосещенныеГруппы", ПосещенныеГруппы);
		
		СвязанныеГруппыВыборка = Запрос.Выполнить().Выбрать();
		Пока СвязанныеГруппыВыборка.Следующий() Цикл
			СвязаннаяГруппа = СвязанныеГруппыВыборка.СвязаннаяГруппа;
			Если СвязанныеГруппы[СвязаннаяГруппа] = Неопределено Тогда
				СвязанныеГруппы.Вставить(СвязаннаяГруппа, Истина);
				Стек.Добавить(СвязаннаяГруппа);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Результат = Новый Массив;
	Для Каждого КлючЗначение Из СвязанныеГруппы Цикл
		Результат.Добавить(КлючЗначение.Ключ);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции


#КонецОбласти

#КонецЕсли
